python/BeginningPython2nd/c04.org
#+title:字典：当索引不好用时
* 字典定义：
  1. 说明：通过名字引用值的数据结构称为映射，字典是Python中唯一内建的
     映射类型；
* 字典的使用:
  1. 说明：通过检查到特定的词语（键），查找到它的含义（值）；
  2. 注意：比较适合电话薄，词典这类实现
  3. 例子：
     #+begin_src python -n
       #用列表来实现电话薄
       >>> phoneNumbers = ['213123','542113','543231','974723']
       >>> names=['Ada', 'Bill', 'Candy', 'David']
       >>> phoneNumbers[names.index('Bill')]
       '542113'
       >>> 
       
     #+end_src
* 创建和使用字典
  1. 说明：字典是由多个键以及其对应的值组成的键值对组成的，字典以左大
     括号开始，并以右大括号结束，键与值之间用冒号分隔，键值对儿之间用
     逗号分隔；
  2. 注意：字典中的键是唯一的
  3. 例子：
     #+begin_src python -n
       >>> mydict={'ada':'1111', 'Bill':'2222', 'Candy':'3333'}
       >>> mydict['Bill']
       '2222'
       >>> 
       
     #+end_src

** dict函数
   1. 说明：用于创建字典的内建函数，参数可以是键与值的序列，可以是关键
      字参数，也可以是其他的映射；
   2. 注意：如果不给dict提供参数，则会返回一个空字典
   3. 例子：
      #+begin_src python -n
        #将序列转换成字典
        >>> mylst=[('name', 'Bill'),('age', 30)]
        >>> mydict = dict(mylst)
        >>> mydict
        {'age': 30, 'name': 'Bill'}
        >>> mydict['name']
        'Bill'
        
        #通过向dict函数传递参数来创建字典
        >>> mylst = dict(height=183,weight=161,hair='black')
        >>> mylst['hair']
        'black'
        
        #通过字典来创建另一个字典
        >>> mylst = dict(mydict)
        >>> mylst
        {'age': 30, 'name': 'Bill'}
        >>> 
        
      #+end_src

** 基本字典操作
   1. 说明：
      1. len（d）：获取字典中键值对的数量；
      2. d[k]：键k对应的值；
      3. d[k]=v：将值v赋给键k；
      4. del d[k]：删除字典d中键为k的项；
      5. k in d：判断字典d中是否包含键为k的项；
   2. 注意：
      1. 键类型：键类型可以是任意不可变类型，如整数，浮点数，字符串等；
      2. 自动添加：如果字典中不包含指定的键，可以通过赋值增加新项；
      3. 成员资格：k in d 是查找字典中是不是有键k对应的项，而列表是查
         找的是值，v in l， 值v是不是在列表中；
      4. 字典中检查键的效率要比列表检查值的高效；
   3. 例子：
      #+begin_src python -n
        #电话薄
        people = {
                'Bill Gunn':
                {
                    'phone': '123456',
                    'addr': 'Tianjin'
                    },
                'Media Zhang':
                {
                    'phone': '999999',
                    'addr': 'Beijing'
                    }
                }
        #输出内容
        lables = {
                'phone' : 'phone number',
                'addr'  : 'address'
                }
        #用户名
        name = input('Name:')
        key = input('Phone number(p) or address(a):')
        if key == 'p' : key = 'phone'
        if key == 'a' : key = 'addr'
        if name in people:
            print("%s %s is %s" % (name, lables[key], people[name][key]))
        input('Press enter!')
        
        >>> 
        Name:Bill Gunn
        Phone number(p) or address(a):a
        Bill Gunn address is Tianjin
        Press enter!
        
      #+end_src
   
** 用字典格式化字符串
   1. 说明：在格式化字符串中的格式化说明符后添加 *键* ，并且 *键* 需要
      用圆括号括起来；
   2. 例子：
      #+begin_src python -n
        >>> table = {
                'Alice' : '457819',
                'Bill'  : '929181',
                'Candy' : '826213'}
        >>> print("Alice's phone number is %(Alice)s." % table)
        Alice's phone number is 457819.
        >>> 
        
      #+end_src

** 字典方法

