python/BeginningPython2nd/c04.html
<?xml version="1.0" encoding="gb2312"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>字典：当索引不好用时</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb2312"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-11-20 12:52:01 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">字典：当索引不好用时</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 字典定义： </a></li>
<li><a href="#sec-2">2 字典的使用: </a></li>
<li><a href="#sec-3">3 创建和使用字典 </a>
<ul>
<li><a href="#sec-3-1">3.1 dict函数 </a></li>
<li><a href="#sec-3-2">3.2 基本字典操作 </a></li>
<li><a href="#sec-3-3">3.3 用字典格式化字符串 </a></li>
<li><a href="#sec-3-4">3.4 字典方法 </a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 clear </a></li>
<li><a href="#sec-3-4-2">3.4.2 copy </a></li>
<li><a href="#sec-3-4-3">3.4.3 fromekeys </a></li>
<li><a href="#sec-3-4-4">3.4.4 get </a></li>
<li><a href="#sec-3-4-5">3.4.5 has_key </a></li>
<li><a href="#sec-3-4-6">3.4.6 items和iteritems </a></li>
<li><a href="#sec-3-4-7">3.4.7 keys </a></li>
<li><a href="#sec-3-4-8">3.4.8 pop </a></li>
<li><a href="#sec-3-4-9">3.4.9 popitem </a></li>
<li><a href="#sec-3-4-10">3.4.10 setdefault </a></li>
<li><a href="#sec-3-4-11">3.4.11 update </a></li>
<li><a href="#sec-3-4-12">3.4.12 values和itervalues </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 字典定义： </h2>
<div class="outline-text-2" id="text-1">

<ol>
<li>说明：通过名字引用值的数据结构称为映射，字典是Python中唯一内建的
     映射类型；
</li>
</ol>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 字典的使用: </h2>
<div class="outline-text-2" id="text-2">

<ol>
<li>说明：通过检查到特定的词语（键），查找到它的含义（值）；
</li>
<li>注意：比较适合电话薄，词典这类实现
</li>
<li>例子：



<pre class="src src-python"><span class="linenr">1:  </span><span style="color: #b22222;">#&#29992;&#21015;&#34920;&#26469;&#23454;&#29616;&#30005;&#35805;&#34180;</span>
<span class="linenr">2:  </span>&gt;&gt;&gt; phoneNumbers = [<span style="color: #8b2252;">'213123'</span>,<span style="color: #8b2252;">'542113'</span>,<span style="color: #8b2252;">'543231'</span>,<span style="color: #8b2252;">'974723'</span>]
<span class="linenr">3:  </span>&gt;&gt;&gt; names=[<span style="color: #8b2252;">'Ada'</span>, <span style="color: #8b2252;">'Bill'</span>, <span style="color: #8b2252;">'Candy'</span>, <span style="color: #8b2252;">'David'</span>]
<span class="linenr">4:  </span>&gt;&gt;&gt; phoneNumbers[names.index(<span style="color: #8b2252;">'Bill'</span>)]
<span class="linenr">5:  </span><span style="color: #8b2252;">'542113'</span>
<span class="linenr">6:  </span>&gt;&gt;&gt; 
<span class="linenr">7:  </span>
</pre>



</li>
</ol>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 创建和使用字典 </h2>
<div class="outline-text-2" id="text-3">

<ol>
<li>说明：字典是由多个键以及其对应的值组成的键值对组成的，字典以左大
     括号开始，并以右大括号结束，键与值之间用冒号分隔，键值对儿之间用
     逗号分隔；
</li>
<li>注意：字典中的键是唯一的
</li>
<li>例子：



<pre class="src src-python"><span class="linenr">1:  </span>&gt;&gt;&gt; mydict={<span style="color: #8b2252;">'ada'</span>:<span style="color: #8b2252;">'1111'</span>, <span style="color: #8b2252;">'Bill'</span>:<span style="color: #8b2252;">'2222'</span>, <span style="color: #8b2252;">'Candy'</span>:<span style="color: #8b2252;">'3333'</span>}
<span class="linenr">2:  </span>&gt;&gt;&gt; mydict[<span style="color: #8b2252;">'Bill'</span>]
<span class="linenr">3:  </span><span style="color: #8b2252;">'2222'</span>
<span class="linenr">4:  </span>&gt;&gt;&gt; 
<span class="linenr">5:  </span>
</pre>



</li>
</ol>



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> dict函数 </h3>
<div class="outline-text-3" id="text-3-1">

<ol>
<li>说明：用于创建字典的内建函数，参数可以是键与值的序列，可以是关键
      字参数，也可以是其他的映射；
</li>
<li>注意：如果不给dict提供参数，则会返回一个空字典
</li>
<li>例子：



<pre class="src src-python"><span class="linenr"> 1:  </span><span style="color: #b22222;">#&#23558;&#24207;&#21015;&#36716;&#25442;&#25104;&#23383;&#20856;</span>
<span class="linenr"> 2:  </span>&gt;&gt;&gt; mylst=[(<span style="color: #8b2252;">'name'</span>, <span style="color: #8b2252;">'Bill'</span>),(<span style="color: #8b2252;">'age'</span>, 30)]
<span class="linenr"> 3:  </span>&gt;&gt;&gt; mydict = <span style="color: #7a378b;">dict</span>(mylst)
<span class="linenr"> 4:  </span>&gt;&gt;&gt; mydict
<span class="linenr"> 5:  </span>{<span style="color: #8b2252;">'age'</span>: 30, <span style="color: #8b2252;">'name'</span>: <span style="color: #8b2252;">'Bill'</span>}
<span class="linenr"> 6:  </span>&gt;&gt;&gt; mydict[<span style="color: #8b2252;">'name'</span>]
<span class="linenr"> 7:  </span><span style="color: #8b2252;">'Bill'</span>
<span class="linenr"> 8:  </span>
<span class="linenr"> 9:  </span><span style="color: #b22222;">#&#36890;&#36807;&#21521;dict&#20989;&#25968;&#20256;&#36882;&#21442;&#25968;&#26469;&#21019;&#24314;&#23383;&#20856;</span>
<span class="linenr">10:  </span>&gt;&gt;&gt; mylst = <span style="color: #7a378b;">dict</span>(height=183,weight=161,hair=<span style="color: #8b2252;">'black'</span>)
<span class="linenr">11:  </span>&gt;&gt;&gt; mylst[<span style="color: #8b2252;">'hair'</span>]
<span class="linenr">12:  </span><span style="color: #8b2252;">'black'</span>
<span class="linenr">13:  </span>
<span class="linenr">14:  </span><span style="color: #b22222;">#&#36890;&#36807;&#23383;&#20856;&#26469;&#21019;&#24314;&#21478;&#19968;&#20010;&#23383;&#20856;</span>
<span class="linenr">15:  </span>&gt;&gt;&gt; mylst = <span style="color: #7a378b;">dict</span>(mydict)
<span class="linenr">16:  </span>&gt;&gt;&gt; mylst
<span class="linenr">17:  </span>{<span style="color: #8b2252;">'age'</span>: 30, <span style="color: #8b2252;">'name'</span>: <span style="color: #8b2252;">'Bill'</span>}
<span class="linenr">18:  </span>&gt;&gt;&gt; 
<span class="linenr">19:  </span>
</pre>



</li>
</ol>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 基本字典操作 </h3>
<div class="outline-text-3" id="text-3-2">

<ol>
<li>说明：
<ol>
<li>len（d）：获取字典中键值对的数量；
</li>
<li>d[k]：键k对应的值；
</li>
<li>d[k]=v：将值v赋给键k；
</li>
<li>del d[k]：删除字典d中键为k的项；
</li>
<li>k in d：判断字典d中是否包含键为k的项；
</li>
</ol>

</li>
<li>注意：
<ol>
<li>键类型：键类型可以是任意不可变类型，如整数，浮点数，字符串等；
</li>
<li>自动添加：如果字典中不包含指定的键，可以通过赋值增加新项；
</li>
<li>成员资格：k in d 是查找字典中是不是有键k对应的项，而列表是查
         找的是值，v in l， 值v是不是在列表中；
</li>
<li>字典中检查键的效率要比列表检查值的高效；
</li>
</ol>

</li>
<li>例子：



<pre class="src src-python"><span class="linenr"> 1:  </span><span style="color: #b22222;">#&#30005;&#35805;&#34180;</span>
<span class="linenr"> 2:  </span><span style="color: #a0522d;">people</span> = {
<span class="linenr"> 3:  </span>        <span style="color: #8b2252;">'Bill Gunn'</span>:
<span class="linenr"> 4:  </span>        {
<span class="linenr"> 5:  </span>            <span style="color: #8b2252;">'phone'</span>: <span style="color: #8b2252;">'123456'</span>,
<span class="linenr"> 6:  </span>            <span style="color: #8b2252;">'addr'</span>: <span style="color: #8b2252;">'Tianjin'</span>
<span class="linenr"> 7:  </span>            },
<span class="linenr"> 8:  </span>        <span style="color: #8b2252;">'Media Zhang'</span>:
<span class="linenr"> 9:  </span>        {
<span class="linenr">10:  </span>            <span style="color: #8b2252;">'phone'</span>: <span style="color: #8b2252;">'999999'</span>,
<span class="linenr">11:  </span>            <span style="color: #8b2252;">'addr'</span>: <span style="color: #8b2252;">'Beijing'</span>
<span class="linenr">12:  </span>            }
<span class="linenr">13:  </span>        }
<span class="linenr">14:  </span><span style="color: #b22222;">#&#36755;&#20986;&#20869;&#23481;</span>
<span class="linenr">15:  </span><span style="color: #a0522d;">lables</span> = {
<span class="linenr">16:  </span>        <span style="color: #8b2252;">'phone'</span> : <span style="color: #8b2252;">'phone number'</span>,
<span class="linenr">17:  </span>        <span style="color: #8b2252;">'addr'</span>  : <span style="color: #8b2252;">'address'</span>
<span class="linenr">18:  </span>        }
<span class="linenr">19:  </span><span style="color: #b22222;">#&#29992;&#25143;&#21517;</span>
<span class="linenr">20:  </span><span style="color: #a0522d;">name</span> = <span style="color: #7a378b;">input</span>(<span style="color: #8b2252;">'Name:'</span>)
<span class="linenr">21:  </span><span style="color: #a0522d;">key</span> = <span style="color: #7a378b;">input</span>(<span style="color: #8b2252;">'Phone number(p) or address(a):'</span>)
<span class="linenr">22:  </span><span style="color: #a020f0;">if</span> key == <span style="color: #8b2252;">'p'</span> : key = <span style="color: #8b2252;">'phone'</span>
<span class="linenr">23:  </span><span style="color: #a020f0;">if</span> key == <span style="color: #8b2252;">'a'</span> : key = <span style="color: #8b2252;">'addr'</span>
<span class="linenr">24:  </span><span style="color: #a020f0;">if</span> name <span style="color: #a020f0;">in</span> people:
<span class="linenr">25:  </span>    <span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"%s %s is %s"</span> % (name, lables[key], people[name][key]))
<span class="linenr">26:  </span><span style="color: #7a378b;">input</span>(<span style="color: #8b2252;">'Press enter!'</span>)
<span class="linenr">27:  </span>
<span class="linenr">28:  </span>&gt;&gt;&gt; 
<span class="linenr">29:  </span>Name:Bill Gunn
<span class="linenr">30:  </span>Phone number(p) <span style="color: #a020f0;">or</span> address(a):a
<span class="linenr">31:  </span>Bill Gunn address <span style="color: #a020f0;">is</span> Tianjin
<span class="linenr">32:  </span>Press enter!
<span class="linenr">33:  </span>
</pre>



</li>
</ol>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 用字典格式化字符串 </h3>
<div class="outline-text-3" id="text-3-3">

<ol>
<li>说明：在格式化字符串中的格式化说明符后添加 <b>键</b> ，并且 <b>键</b> 需要
      用圆括号括起来；
</li>
<li>例子：



<pre class="src src-python"><span class="linenr">1:  </span>&gt;&gt;&gt; table = {
<span class="linenr">2:  </span>        <span style="color: #8b2252;">'Alice'</span> : <span style="color: #8b2252;">'457819'</span>,
<span class="linenr">3:  </span>        <span style="color: #8b2252;">'Bill'</span>  : <span style="color: #8b2252;">'929181'</span>,
<span class="linenr">4:  </span>        <span style="color: #8b2252;">'Candy'</span> : <span style="color: #8b2252;">'826213'</span>}
<span class="linenr">5:  </span>&gt;&gt;&gt; <span style="color: #a020f0;">print</span>(<span style="color: #8b2252;">"Alice's phone number is %(Alice)s."</span> % table)
<span class="linenr">6:  </span>Alice<span style="color: #8b2252;">'s phone number is 457819.</span>
<span class="linenr">7:  </span><span style="color: #8b2252;">&gt;&gt;&gt; </span>
<span class="linenr">8:  </span>
</pre>



</li>
</ol>


</div>

</div>
