python/BeginningPython2nd/c04.org
*** items和iteritems
    1. 说明：items以列表方式返回字典中的键值对，iteritems以迭代器对象
       返回键值对儿(Python3中不再支持）；
    2. 例子：
       #+begin_src python -n
         >>> x
         {'name': 'Bill'}
         >>> x.items()
         dict_items([('name', 'Bill')])
         
         #python3中不再包含iteritems
         >>> x.iteritems()
         Traceback (most recent call last):
           File "<pyshell#66>", line 1, in <module>
             x.iteritems()
         AttributeError: 'dict' object has no attribute 'iteritems'
         
       #+end_src
   
*** keys
    1. 说明：返回字典中的 *键*
    2. 例子：
       #+begin_src python -n
         >>> x = {'Name':'Bill', 'Age':'30'}
         >>> x
         {'Age': '30', 'Name': 'Bill'}
         >>> x.keys()
         dict_keys(['Age', 'Name'])
         >>> 
         
       #+end_src
   
*** pop
    1. 说明：用于获取给定键的值，并将该键值对从字典中移除
    2. 例子：
       #+begin_src python -n
         >>> x = {'a':1,'b':2}
         >>> x
         {'a': 1, 'b': 2}
         >>> x.pop('a')
         1
         >>> x
         {'b': 2}
         >>> 
         
       #+end_src
*** popitem
    1. 说明：用于随机弹出字典中的键值对儿；
    2. 例子：
       #+begin_src python -n
         >>> x = {'a': '1', 'c': '3', 'b': '2'}
         >>> while len(x) > 0:
                 x.popitem()
         ('a', '1')
         ('c', '3')
         ('b', 2)
         >>> x
         {}
         
       #+end_src
*** setdefault
    1. 说明：可以获得给定键的值，如果字典中没有给定键，可以在字典中添
       加给定键。如果没有指定给定键的默认值，并且给定键也不在字典中，
       则在添加给定键后，将其值设置为 *None* 。
    2. 例子：
       #+begin_src python -n
         >>> x = {'a':'1','b':'2','c':'3'}
         >>> x
         {'a': '1', 'c': '3', 'b': '2'}
         #字典中包含 a，所以返回键a对应的值1
         >>> x.setdefault('a')
         '1'
         #因为字典中有键a，所以setdefault方法不会改变键a对应的值
         >>> x.setdefault('a', 'A')
         '1'
         >>> x
         {'a': '1', 'c': '3', 'b': '2'}
         #字典中没有键d，调用setdefault方法时也没有设置默认值，
         #所以调用后，在字典中添加了键为d的键值对儿，并返回空。
         >>> x.setdefault('d')
         >>> x
         {'a': '1', 'c': '3', 'b': '2', 'd': None}
         #调用setdefault时带默认值
         >>> x.setdefault('e', '5')
         '5'
         >>> x
         {'a': '1', 'c': '3', 'b': '2', 'e': '5', 'd': None}
         >>> x.setdefault('d', '4')
         >>> 
         
       #+end_src
*** update
    1. 说明：将新字典中的键值对儿更新到原字典中，如果新字典中有的键值
       对儿，原字典中没有，则会在原字典中增加新键值对儿；
    2. 例子：
       #+begin_src python -n
         >>> x = {'a':'1','b':'2','c':'3'}
         >>> x
         {'a': '1', 'c': '3', 'b': '2'}
         >>> y = {'a':'A', 'z':'zoo'}
         >>> x.update(y)
         #键‘a’被更新到字典中，‘z’被添加到字典中
         >>> x
         {'a': 'A', 'c': '3', 'b': '2', 'e': '5', 'd': None, 'z': 'zoo'}
         >>> z=[('g','11'),('q','12')]
         >>> x.update(z)
         >>> x
         {'a': 'A', 'q': '12', 'c': '3', 'b': '2', 'e': '5', 'd': None, 'g': '11', 'z': 'zoo'}
         >>> 
         
       #+end_src
