python/BeginningPython2nd/c04.html

<div id="outline-container-3-4-6" class="outline-4">
<h4 id="sec-3-4-6"><span class="section-number-4">3.4.6</span> items和iteritems </h4>
<div class="outline-text-4" id="text-3-4-6">

<ol>
<li>说明：items以列表方式返回字典中的键值对，iteritems以迭代器对象
       返回键值对儿(Python3中不再支持）；
</li>
<li>例子：



<pre class="src src-python"><span class="linenr"> 1:  </span>&gt;&gt;&gt; x
<span class="linenr"> 2:  </span>{<span style="color: #8b2252;">'name'</span>: <span style="color: #8b2252;">'Bill'</span>}
<span class="linenr"> 3:  </span>&gt;&gt;&gt; x.items()
<span class="linenr"> 4:  </span>dict_items([(<span style="color: #8b2252;">'name'</span>, <span style="color: #8b2252;">'Bill'</span>)])
<span class="linenr"> 5:  </span>
<span class="linenr"> 6:  </span><span style="color: #b22222;">#python3&#20013;&#19981;&#20877;&#21253;&#21547;iteritems</span>
<span class="linenr"> 7:  </span>&gt;&gt;&gt; x.iteritems()
<span class="linenr"> 8:  </span>Traceback (most recent call last):
<span class="linenr"> 9:  </span>  File <span style="color: #8b2252;">"&lt;pyshell#66&gt;"</span>, line 1, <span style="color: #a020f0;">in</span> &lt;module&gt;
<span class="linenr">10:  </span>    x.iteritems()
<span class="linenr">11:  </span><span style="color: #228b22;">AttributeError</span>: <span style="color: #8b2252;">'dict'</span> <span style="color: #7a378b;">object</span> has no attribute <span style="color: #8b2252;">'iteritems'</span>
<span class="linenr">12:  </span>
</pre>



</li>
</ol>


</div>

</div>

<div id="outline-container-3-4-7" class="outline-4">
<h4 id="sec-3-4-7"><span class="section-number-4">3.4.7</span> keys </h4>
<div class="outline-text-4" id="text-3-4-7">

<ol>
<li>说明：返回字典中的 <b>键</b>
</li>
<li>例子：



<pre class="src src-python"><span class="linenr">1:  </span>&gt;&gt;&gt; x = {<span style="color: #8b2252;">'Name'</span>:<span style="color: #8b2252;">'Bill'</span>, <span style="color: #8b2252;">'Age'</span>:<span style="color: #8b2252;">'30'</span>}
<span class="linenr">2:  </span>&gt;&gt;&gt; x
<span class="linenr">3:  </span>{<span style="color: #8b2252;">'Age'</span>: <span style="color: #8b2252;">'30'</span>, <span style="color: #8b2252;">'Name'</span>: <span style="color: #8b2252;">'Bill'</span>}
<span class="linenr">4:  </span>&gt;&gt;&gt; x.keys()
<span class="linenr">5:  </span>dict_keys([<span style="color: #8b2252;">'Age'</span>, <span style="color: #8b2252;">'Name'</span>])
<span class="linenr">6:  </span>&gt;&gt;&gt; 
<span class="linenr">7:  </span>
</pre>



</li>
</ol>


</div>

</div>

<div id="outline-container-3-4-8" class="outline-4">
<h4 id="sec-3-4-8"><span class="section-number-4">3.4.8</span> pop </h4>
<div class="outline-text-4" id="text-3-4-8">

<ol>
<li>说明：用于获取给定键的值，并将该键值对从字典中移除
</li>
<li>例子：



<pre class="src src-python"><span class="linenr">1:  </span>&gt;&gt;&gt; x = {<span style="color: #8b2252;">'a'</span>:1,<span style="color: #8b2252;">'b'</span>:2}
<span class="linenr">2:  </span>&gt;&gt;&gt; x
<span class="linenr">3:  </span>{<span style="color: #8b2252;">'a'</span>: 1, <span style="color: #8b2252;">'b'</span>: 2}
<span class="linenr">4:  </span>&gt;&gt;&gt; x.pop(<span style="color: #8b2252;">'a'</span>)
<span class="linenr">5:  </span>1
<span class="linenr">6:  </span>&gt;&gt;&gt; x
<span class="linenr">7:  </span>{<span style="color: #8b2252;">'b'</span>: 2}
<span class="linenr">8:  </span>&gt;&gt;&gt; 
<span class="linenr">9:  </span>
</pre>



</li>
</ol>

</div>

</div>

<div id="outline-container-3-4-9" class="outline-4">
<h4 id="sec-3-4-9"><span class="section-number-4">3.4.9</span> popitem </h4>
<div class="outline-text-4" id="text-3-4-9">

<ol>
<li>说明：用于随机弹出字典中的键值对儿；
</li>
<li>例子：



<pre class="src src-python"><span class="linenr">1:  </span>&gt;&gt;&gt; x = {<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>}
<span class="linenr">2:  </span>&gt;&gt;&gt; <span style="color: #a020f0;">while</span> <span style="color: #7a378b;">len</span>(x) &gt; 0:
<span class="linenr">3:  </span>        x.popitem()
<span class="linenr">4:  </span>(<span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'1'</span>)
<span class="linenr">5:  </span>(<span style="color: #8b2252;">'c'</span>, <span style="color: #8b2252;">'3'</span>)
<span class="linenr">6:  </span>(<span style="color: #8b2252;">'b'</span>, 2)
<span class="linenr">7:  </span>&gt;&gt;&gt; x
<span class="linenr">8:  </span>{}
<span class="linenr">9:  </span>
</pre>



</li>
</ol>

</div>

</div>

<div id="outline-container-3-4-10" class="outline-4">
<h4 id="sec-3-4-10"><span class="section-number-4">3.4.10</span> setdefault </h4>
<div class="outline-text-4" id="text-3-4-10">

<ol>
<li>说明：可以获得给定键的值，如果字典中没有给定键，可以在字典中添
       加给定键。如果没有指定给定键的默认值，并且给定键也不在字典中，
       则在添加给定键后，将其值设置为 <b>None</b> 。
</li>
<li>例子：



<pre class="src src-python"><span class="linenr"> 1:  </span>&gt;&gt;&gt; x = {<span style="color: #8b2252;">'a'</span>:<span style="color: #8b2252;">'1'</span>,<span style="color: #8b2252;">'b'</span>:<span style="color: #8b2252;">'2'</span>,<span style="color: #8b2252;">'c'</span>:<span style="color: #8b2252;">'3'</span>}
<span class="linenr"> 2:  </span>&gt;&gt;&gt; x
<span class="linenr"> 3:  </span>{<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>}
<span class="linenr"> 4:  </span><span style="color: #b22222;">#&#23383;&#20856;&#20013;&#21253;&#21547; a&#65292;&#25152;&#20197;&#36820;&#22238;&#38190;a&#23545;&#24212;&#30340;&#20540;1</span>
<span class="linenr"> 5:  </span>&gt;&gt;&gt; x.setdefault(<span style="color: #8b2252;">'a'</span>)
<span class="linenr"> 6:  </span><span style="color: #8b2252;">'1'</span>
<span class="linenr"> 7:  </span><span style="color: #b22222;">#&#22240;&#20026;&#23383;&#20856;&#20013;&#26377;&#38190;a&#65292;&#25152;&#20197;setdefault&#26041;&#27861;&#19981;&#20250;&#25913;&#21464;&#38190;a&#23545;&#24212;&#30340;&#20540;</span>
<span class="linenr"> 8:  </span>&gt;&gt;&gt; x.setdefault(<span style="color: #8b2252;">'a'</span>, <span style="color: #8b2252;">'A'</span>)
<span class="linenr"> 9:  </span><span style="color: #8b2252;">'1'</span>
<span class="linenr">10:  </span>&gt;&gt;&gt; x
<span class="linenr">11:  </span>{<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>}
<span class="linenr">12:  </span><span style="color: #b22222;">#&#23383;&#20856;&#20013;&#27809;&#26377;&#38190;d&#65292;&#35843;&#29992;setdefault&#26041;&#27861;&#26102;&#20063;&#27809;&#26377;&#35774;&#32622;&#40664;&#35748;&#20540;&#65292;</span>
<span class="linenr">13:  </span><span style="color: #b22222;">#&#25152;&#20197;&#35843;&#29992;&#21518;&#65292;&#22312;&#23383;&#20856;&#20013;&#28155;&#21152;&#20102;&#38190;&#20026;d&#30340;&#38190;&#20540;&#23545;&#20799;&#65292;&#24182;&#36820;&#22238;&#31354;&#12290;</span>
<span class="linenr">14:  </span>&gt;&gt;&gt; x.setdefault(<span style="color: #8b2252;">'d'</span>)
<span class="linenr">15:  </span>&gt;&gt;&gt; x
<span class="linenr">16:  </span>{<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'d'</span>: <span style="color: #008b8b;">None</span>}
<span class="linenr">17:  </span><span style="color: #b22222;">#&#35843;&#29992;setdefault&#26102;&#24102;&#40664;&#35748;&#20540;</span>
<span class="linenr">18:  </span>&gt;&gt;&gt; x.setdefault(<span style="color: #8b2252;">'e'</span>, <span style="color: #8b2252;">'5'</span>)
<span class="linenr">19:  </span><span style="color: #8b2252;">'5'</span>
<span class="linenr">20:  </span>&gt;&gt;&gt; x
<span class="linenr">21:  </span>{<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'e'</span>: <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'d'</span>: <span style="color: #008b8b;">None</span>}
<span class="linenr">22:  </span>&gt;&gt;&gt; x.setdefault(<span style="color: #8b2252;">'d'</span>, <span style="color: #8b2252;">'4'</span>)
<span class="linenr">23:  </span>&gt;&gt;&gt; 
<span class="linenr">24:  </span>
</pre>



</li>
</ol>

</div>

</div>

<div id="outline-container-3-4-11" class="outline-4">
<h4 id="sec-3-4-11"><span class="section-number-4">3.4.11</span> update </h4>
<div class="outline-text-4" id="text-3-4-11">

<ol>
<li>说明：将新字典中的键值对儿更新到原字典中，如果新字典中有的键值
       对儿，原字典中没有，则会在原字典中增加新键值对儿；
</li>
<li>例子：



<pre class="src src-python"><span class="linenr"> 1:  </span>&gt;&gt;&gt; x = {<span style="color: #8b2252;">'a'</span>:<span style="color: #8b2252;">'1'</span>,<span style="color: #8b2252;">'b'</span>:<span style="color: #8b2252;">'2'</span>,<span style="color: #8b2252;">'c'</span>:<span style="color: #8b2252;">'3'</span>}
<span class="linenr"> 2:  </span>&gt;&gt;&gt; x
<span class="linenr"> 3:  </span>{<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'1'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>}
<span class="linenr"> 4:  </span>&gt;&gt;&gt; y = {<span style="color: #8b2252;">'a'</span>:<span style="color: #8b2252;">'A'</span>, <span style="color: #8b2252;">'z'</span>:<span style="color: #8b2252;">'zoo'</span>}
<span class="linenr"> 5:  </span>&gt;&gt;&gt; x.update(y)
<span class="linenr"> 6:  </span><span style="color: #b22222;">#&#38190;&#8216;a&#8217;&#34987;&#26356;&#26032;&#21040;&#23383;&#20856;&#20013;&#65292;&#8216;z&#8217;&#34987;&#28155;&#21152;&#21040;&#23383;&#20856;&#20013;</span>
<span class="linenr"> 7:  </span>&gt;&gt;&gt; x
<span class="linenr"> 8:  </span>{<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'A'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'e'</span>: <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'d'</span>: <span style="color: #008b8b;">None</span>, <span style="color: #8b2252;">'z'</span>: <span style="color: #8b2252;">'zoo'</span>}
<span class="linenr"> 9:  </span>&gt;&gt;&gt; z=[(<span style="color: #8b2252;">'g'</span>,<span style="color: #8b2252;">'11'</span>),(<span style="color: #8b2252;">'q'</span>,<span style="color: #8b2252;">'12'</span>)]
<span class="linenr">10:  </span>&gt;&gt;&gt; x.update(z)
<span class="linenr">11:  </span>&gt;&gt;&gt; x
<span class="linenr">12:  </span>{<span style="color: #8b2252;">'a'</span>: <span style="color: #8b2252;">'A'</span>, <span style="color: #8b2252;">'q'</span>: <span style="color: #8b2252;">'12'</span>, <span style="color: #8b2252;">'c'</span>: <span style="color: #8b2252;">'3'</span>, <span style="color: #8b2252;">'b'</span>: <span style="color: #8b2252;">'2'</span>, <span style="color: #8b2252;">'e'</span>: <span style="color: #8b2252;">'5'</span>, <span style="color: #8b2252;">'d'</span>: <span style="color: #008b8b;">None</span>, <span style="color: #8b2252;">'g'</span>: <span style="color: #8b2252;">'11'</span>, <span style="color: #8b2252;">'z'</span>: <span style="color: #8b2252;">'zoo'</span>}
<span class="linenr">13:  </span>&gt;&gt;&gt; 
<span class="linenr">14:  </span>
</pre>



</li>
</ol>

</div>

</div>
